Revit 2027 API
BuiltInFailures.SiteFailures.CannotComputeProperArea Property
 Property Lines must close. Area will not be computed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotComputeProperArea { get; }
Public Shared ReadOnly Property CannotComputeProperArea As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotComputeProperArea {
	FailureDefinitionId^ get ();
}
static member CannotComputeProperArea : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace